namespace CreationalDesignPatterns.Singleton
{
    class Singleton_Naive
    {
        private Singleton_Naive() { }

        // Объект одиночки храниться в статичном поле класса. Существует
        // несколько способов инициализировать это поле, и все они имеют разные
        // достоинства и недостатки. В этом примере мы рассмотрим простейший из
        // них, недостатком которого является полная неспособность правильно
        // работать в многопоточной среде.
        private static Singleton_Naive _instance;

        // Это статический метод, управляющий доступом к экземпляру одиночки.
        // При первом запуске, он создаёт экземпляр одиночки и помещает его в
        // статическое поле. При последующих запусках, он возвращает клиенту
        // объект, хранящийся в статическом поле.
        public static Singleton_Naive GetInstance()
        {
            if (_instance == null)
            {
                _instance = new Singleton_Naive();
            }
            return _instance;
        }
    }
}